# Exercice S2-B

In [38]:
#import de la librairie 
import pandas as pd

In [39]:
#chargement du dataset 
dataset = pd.read_csv("../../data/chipotle.csv")

In [47]:
#5 première lignes 
dataset[:10]

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,6,3,1,Side of Chips,NaN,$1.69
7,7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [4]:
#affichage des colonnes dataset 
dataset.columns

Index(['Unnamed: 0', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [48]:
for x in dataset : 
    print(x)

Unnamed: 0
order_id
quantity
item_name
choice_description
item_price

In [5]:
#description 
dataset.describe()

        Unnamed: 0     order_id     quantity
count  4622.000000  4622.000000  4622.000000
mean   2310.500000   927.254868     1.075725
std    1334.400802   528.890796     0.410186
min       0.000000     1.000000     1.000000
25%    1155.250000   477.250000     1.000000
50%    2310.500000   926.000000     1.000000
75%    3465.750000  1393.000000     1.000000
max    4621.000000  1834.000000    15.000000

In [6]:
#tris des 10 items les plus commandés 
dataset.groupby("item_name").sum().sort_values(["quantity"], ascending=False)[:10]

                              Unnamed: 0  order_id  quantity
item_name
Chicken Bowl                     1779909    713926       761
Chicken Burrito                  1238217    497303       591
Chips and Guacamole              1121773    449959       506
Steak Burrito                     817795    328437       386
Canned Soft Drink                 759990    304753       351
Chips                             518704    208004       230
Steak Bowl                        482721    193752       221
Bottled Water                     439354    175944       211
Chips and Fresh Tomato Salsa      250144    100419       130
Canned Soda                       189915     76396       126

In [60]:
#Nombre d'items commandés au total chez Chipotle
dataset.quantity.sum()

4972

In [8]:
#type d'une colonne
type(dataset.item_price)

pandas.core.series.Series

In [61]:
priceTab = dataset.item_price.str[1:]
#autre moyen 
dataset['item_price'] = dataset.item_price.str.replace('$', '').astype('float64')

In [62]:
#chiffre d’affaire realisé par Chipotle
p = priceTab.astype('float64')
q = dataset.quantity.astype('float64')
print("Le chiffre d'affaire de la société est de : {}€".format((p*q).sum().round(1)))

Le chiffre d'affaire de la société est de : 39237.0€

In [37]:
dataset["revenue"] = dataset['quantity'] * dataset["item_price"]
dataset.groupby("order_id")['revenue'].sum().mean()
#dataset.head()

21.394231188658654

In [11]:
dataset.iloc[:2]
# iloc[0:2] == iloc[:2] == loc[0:1] == [0:2]

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39

In [12]:
dataset.loc[0:2]

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39

In [13]:
dataset[0:2]

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39

In [14]:
#filtrage avec loc
f1 = dataset.loc[dataset['quantity']==2]
#dataset.loc[dataset['quantity']==2] == dataset[dataset['quantity']==2]
f1.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
18,18,9,2,Canned Soda,[Sprite],$2.18
51,51,23,2,Canned Soda,[Mountain Dew],$2.18
135,135,60,2,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Sour Cream, Che...",$22.50
148,148,67,2,Steak Burrito,"[Tomatillo-Red Chili Salsa (Hot), [Rice, Chees...",$17.98

In [15]:
#utilisation méthodes maths (means / sum) directement sur des objets Series 
dataset['quantity'].astype('float64').mean()

1.0757247944612722